{
  "BidZenith - Discover the Most Sought-After Auctions": "BidZenith - Descubra os Leilões Mais Procurados",
  "Join exclusive auctions with an interactive and secure experience.": "Participe em leilões exclusivos com uma experiência interativa e segura.",
  "auctions, bidding, online auctions, BidZenith": "leilões, lances, leilões online, BidZenith",
  "Search": "Buscar",
  "Search...": "Buscar...",
  "Toggle Dark Mode": "Alternar para Modo Escuro",
  "BidZenith Home": "Página Inicial do BidZenith",
  "BidZenith": "BidZenith",
  "Discover the Most Sought-After Auctions": "Descubra os Leilões Mais Procurados",
  "Explore Auctions": "Explorar Leilões",
  "Experience the Future of Online Auctions": "Experimente o Futuro dos Leilões Online",
  "Real-Time Bidding": "Lances em Tempo Real",
  "Engage in auctions with live updates and real-time bidding capabilities.": "Participe em leilões com atualizações em tempo real e capacidades de lances imediatos.",
  "Exclusive Items": "Itens Exclusivos",
  "Access a curated selection of rare and exclusive items.": "Tenha acesso a uma seleção sofisticada de itens raros e exclusivos.",
  "Mobile Friendly": "Compatível com Dispositivos Móveis",
  "Enjoy a seamless experience across all your devices.": "Desfrute de uma experiência perfeita em todos os seus dispositivos.",
  "Active Auctions": "Leilões Ativos",
  "00:00:00": "00:00:00",
  "Participate": "Participar",
  "What Our Users Say": "O Que os Nossos Utilizadores Dizem",
  "Social Media": "Redes Sociais",
  "Facebook": "Facebook",
  "Twitter": "Twitter",
  "Instagram": "Instagram",
  "All Rights Reserved.": "Todos os Direitos Reservados.",
  "Test String": "Texto de Teste",
  "Login": "Entrar",
  "Register": "Cadastrar",
  "Messages": "Mensagens",
  "Notifications": "Notificações",
  "Profile": "Perfil",
  "Settings": "Configurações",
  "Logout": "Sair",
  "Home": "Página Inicial",
  "Auctions": "Leilões",
  "Categories": "Categorias",
  "About Us": "Sobre Nós",
  "Contact": "Contacto",
  "All Categories": "Todas as Categorias",
  "Electronics": "Eletrónicos",
        "Art": "Arte",
        "Fashion": "Moda",
        "Home & Garden": "Casa & Jardim",
        "Vehicles": "Veículos",
        "Mobile Phones": "Telemóveis",
        "Laptops": "Portáteis",
        "Paintings": "Pinturas",
        "Sculptures": "Esculturas",
        "Men s Clothing": "Roupas Masculinas",
        "Women s Clothing": "Roupas Femininas",
        "Furniture": "Mobiliário",
        "Kitchen Appliances": "Eletrodomésticos de Cozinha",
        "Cars": "Carros",
        "Motorcycles": "Motas",
  "Create Auction": "Criar Leilão",
  "Upcoming Auctions": "Leilões Futuros",
  "Edit Auction": "Editar Leilão",
  "There were some problems with your input.": "Houve alguns problemas com a sua entrada.",
  "Title": "Título",
  "Description": "Descrição",
  "Category": "Categoria",
  "Starting Price": "Preço Inicial",
  "Reserve Price": "Preço de Reserva",
  "Minimum Bid Increment": "Incremento Mínimo de Lance",
  "Starting Date": "Data de Início",
  "Ending Date": "Data de Fim",
  "Location": "Localização",
  "Status": "Estado",
  "Active": "Ativo",
  "Upcoming": "Futuro",
  "Update Auction": "Atualizar Leilão",
  "Current Bid": "Lance Atual",
  "View Auction": "Ver Leilão",
  "Search Results for": "Resultados de pesquisa para",
  "No auctions found.": "Nenhum leilão encontrado.",
  "Auction Details": "Detalhes do Leilão",
  "Delete Auction": "Apagar Leilão",
  "Are you sure you want to delete this auction?": "Tem a certeza de que deseja apagar este leilão?",
  "Bid Price": "Valor do Lance",
  "Place Bid": "Fazer Lance",
  "View Bidding History": "Ver Histórico de Lances",
  "User Profile": "Perfil de Utilizador",
  "Full Name": "Nome Completo",
  "Tax ID": "NIF",
  "Edit Profile": "Editar Perfil",
  "My Auctions": "Meus Leilões",
  "Information about your company or website.": "Informação sobre a sua empresa ou website.",
  "Contact Us": "Contacto",
  "Contact information or a contact form.": "Informação de contacto ou um formulário de contacto.",
  "Bidding History for": "Histórico de Lances para",
  "Bidder": "Licitante",
  "Bid Amount": "Quantia do Lance",
  "Bid Time": "Data do Lance",
  "Back to Auction": "Voltar ao Leilão",
  "Category:": "Categoria:",
  "All": "Todas",
  "Minimum Price:": "Preço Mínimo:",
  "Maximum Price:": "Preço Máximo:",
  "Status:": "Estado:",
  "Completed": "Concluído",
  "Apply Filters": "Aplicar Filtros",
  "Seller:": "Vendedor:",
  "No auctions found for the applied filters.": "Não foram encontrados leilões para os filtros aplicados.",
  "Profile of": "Perfil de",
  "Email:": "Email:",
  "Username:": "Username:",
  "Tax ID:": "NIF:",
  "Admin:": "Admin:",
  "Enterprise:": "Empresa:",
  "Yes": "Sim",
  "No": "Não",
  "Created Auctions": "Leilões Criados",
  "View Seller": "Ver Vendedor",
  "This user has no active auctions.": "Este utilizador não tem leilões ativos.",
  "A new bid of €:amount has been placed on your auction: :auction by :bidder.": "Uma nova oferta de €:amount foi feita no seu leilão: :auction por :bidder.",
  "View Details": "Ver detalhes",
  "Error fetching notifications": "Erro ao procurar notificações",
  "Error marking notification as read": "Erro ao marcar notificação como lida",
  "My Notifications": "As Minhas Notificações",
  "New notification": "Nova notificação",
  "Notification Details": "Detalhes da Notificação",
  "Auction": "Leilão",
  "Delete Account": "Apagar conta",
  "Upload Profile Picture": "Carregar Imagem de perfil",
  "Upload": "Carregar imagem",
  "BidZenith aims to revolutionize the online auction experience by offering a seamless, secure, and interactive platform that combines the excitement of bidding. We envision a dynamic marketplace where users from around the world can effortlessly discover and bid on exclusive, hard-to-find items. Through innovative features such as gamified points, personalized recommendations, and real-time interaction via live chat, we seek to make online auctions more engaging and fun. Our goal is to create a trusted, user-friendly platform that scales with demand, offering a reliable space where both buyers and sellers feel empowered. BidZenith is set to redefine the future of online auctions by delivering a rich, immersive, and secure experience.": "A BidZenith pretende revolucionar a experiência dos leilões online, oferecendo uma plataforma segura e interactiva que combina a emoção da licitação. Prevemos um mercado dinâmico onde os utilizadores de todo o mundo podem descobrir e licitar sem esforço em artigos exclusivos e difíceis de encontrar. Através de caraterísticas inovadoras, como pontos de jogo, recomendações personalizadas e interação em tempo real através de chat ao vivo, procuramos tornar os leilões online mais envolventes e divertidos. O nosso objetivo é criar uma plataforma de confiança e de fácil utilização que se adapte à procura, oferecendo um espaço fiável onde tanto os compradores como os vendedores se sintam capacitados. A BidZenith está pronta para redefinir o futuro dos leilões on-line, oferecendo uma experiência rica, imersiva e segura.",
  "Mission": "Missão",
  "Our primary mission is to transform the conventional auction and bidding experience into something more enjoyable, interactive, and reminiscent of an engaging game. We recognize that the traditional auction process can often be intimidating and impersonal, which can deter potential participants. To address this, we aim to infuse elements of gamification into our platform by implementing a comprehensive points and recommendations system. This system not only rewards active participation but also fosters a sense of achievement and loyalty among users. Additionally, by integrating live chat functionality into various auctions, we enhance real-time interaction, allowing bidders to communicate, strategize, and build a community within the platform.": "A nossa principal missão é transformar a experiência convencional de leilões e licitações em algo mais agradável, interativo e que faça lembrar um jogo envolvente. Reconhecemos que o processo tradicional de leilão pode muitas vezes ser intimidante e impessoal, o que pode dissuadir potenciais participantes. Para resolver este problema, pretendemos introduzir elementos de gamificação na nossa plataforma, implementando um sistema abrangente de pontos e recomendações. Este sistema não só recompensa a participação ativa, como também promove um sentimento de realização e lealdade entre os utilizadores. Além disso, ao integrar a funcionalidade de chat ao vivo em vários leilões, melhoramos a interação em tempo real, permitindo que os licitantes comuniquem, criem estratégias e construam uma comunidade dentro da plataforma.",
  "Goals & Objectives": "Metas & Objetivos",
  "The main objectives of BidZenith are to create a secure and user-friendly online auction platform that enables users to bid on and purchase unique and exclusive items from around the world with ease. BidZenith aims to enhance the auction experience by offering a variety of auction types, real-time bidding capabilities, and advanced search functionalities, thereby fostering greater user engagement and trust. Additionally, the platform is designed to ensure scalability and reliability to accommodate a growing user base, while providing administrators with comprehensive tools to manage users, oversee auctions, and maintain system integrity.": "Os principais objectivos da BidZenith consistem em criar uma plataforma de leilões em linha segura e de fácil utilização que permita aos utilizadores licitar e comprar facilmente artigos únicos e exclusivos de todo o mundo. A BidZenith pretende melhorar a experiência de leilão, oferecendo uma variedade de tipos de leilão, capacidades de licitação em tempo real e funcionalidades de pesquisa avançadas, promovendo assim um maior envolvimento e confiança dos utilizadores. Além disso, a plataforma foi concebida para garantir a escalabilidade e a fiabilidade para acomodar uma base de utilizadores em crescimento, ao mesmo tempo que fornece aos administradores ferramentas abrangentes para gerir os utilizadores, supervisionar os leilões e manter a integridade do sistema.",
  "Get in Touch": "Contacte-nos",
  "For Information": "Para Informação",
  "For General Inquiries": "Para Questões de Carácter Geral",
  "For Help": "Para Ajuda",
  "We would love to hear from you! Please reach out to us using the following contact information:": "Gostaríamos muito de o ouvir! Entre em contacto connosco utilizando as seguintes informações de contacto:",
  "Access user profiles:": "Aceder aos perfis dos utilizadores:",
  "Users can access other users' profiles to view their feedback and bidding history.": "Os utilizadores podem aceder aos perfis de outros utilizadores para visualizar o feedback e o histórico de licitações.",

  "Browse auctions by category:": "Procurar leilões por categoria:",
  "Allows browsing auctions by predefined categories (e.g., technology, art, fashion).": "Permite procurar leilões por categorias predefinidas (por exemplo, tecnologia, arte, moda).",

  "Search auctions:": "Pesquisar leilões:",
  "Users can search auctions based on simple and advanced criteria, including title, category, price range, and end date.": "Os utilizadores podem pesquisar leilões com base em critérios simples e avançados, incluindo título, categoria, intervalo de preços e data de término.",

  "Create auctions:": "Criar leilões:",
  "Authenticated sellers can create new auctions by providing a title, description, starting price, images, category, and auction duration.": "Vendedores autenticados podem criar novos leilões fornecendo um título, descrição, preço inicial, imagens, categoria e duração do leilão.",

  "Follow auctions:": "Seguir leilões:",
  "Authenticated users can follow auctions of interest to receive updates and notifications.": "Os utilizadores autenticados podem seguir leilões de interesse para receber atualizações e notificações.",

  "View followed auctions:": "Ver leilões seguidos:",
  "Access to a list of followed auctions to easily monitor them.": "Acesso a uma lista de leilões seguidos para monitorizá-los facilmente.",

  "View bidding history:": "Ver histórico de licitações:",
  "Users can view the complete history of bids made on each auction.": "Os utilizadores podem ver o histórico completo de licitações feitas em cada leilão.",

  "Manage created auctions:": "Gerir leilões criados:",
  "Sellers can edit or cancel auctions as long as they haven’t received bids yet.": "Os vendedores podem editar ou cancelar leilões desde que ainda não tenham recebido licitações.",

  "Place bids on active auctions:": "Fazer licitações em leilões ativos:",
  "Authenticated buyers can place bids on active auctions, with automatic bid increments when necessary.": "Compradores autenticados podem fazer licitações em leilões ativos, com incrementos automáticos de licitação quando necessário.",

  "View bidding history in an auction:": "Ver histórico de licitações num leilão:",
  "Allows users to view all bids placed in an auction, including date, amount, and user.": "Permite aos utilizadores ver todas as licitações feitas num leilão, incluindo data, valor e utilizador.",

  "Extend auction time:": "Estender o tempo do leilão:",
  "If a bid is placed within the last 15 minutes, the auction time is automatically extended to ensure competitiveness.": "Se uma licitação for feita nos últimos 15 minutos, o tempo do leilão é automaticamente estendido para garantir competitividade.",

  "Notification of new bids on owned or followed auctions:": "Notificação de novas licitações em leilões próprios ou seguidos:",
  "Users receive notifications whenever a new bid is placed on an auction they own or follow.": "Os utilizadores recebem notificações sempre que uma nova licitação for feita num leilão que possuem ou seguem.",

  "Notifications about won, lost, or canceled auctions:": "Notificações sobre leilões ganhos, perdidos ou cancelados:",
  "Notifications are sent to users informing them if they won or lost an auction, or if an auction was canceled.": "As notificações são enviadas aos utilizadores informando-os se ganharam ou perderam um leilão ou se este foi cancelado.",

  "Auction end notifications:": "Notificações de fim de leilão:",
  "Users receive notifications when an auction they are involved in ends.": "Os utilizadores recebem notificações quando um leilão em que participam termina.",

  "Notification for the auction winner:": "Notificação para o vencedor do leilão:",
  "The auction winner is notified as soon as the auction ends.": "O vencedor do leilão é notificado assim que o leilão termina.",

  "Push notifications via email or app:": "Notificações push via email ou app:",
  "Users can choose to receive push notifications via the app or email to stay updated on bids and auctions.": "Os utilizadores podem optar por receber notificações push através da aplicação ou por email para se manterem atualizados sobre licitações e leilões.",

  "Dark mode:": "Modo escuro:",
  "Option to switch to dark mode, improving the experience in low-light environments.": "Opção de alternar para o modo escuro, melhorando a experiência em ambientes com pouca luz.",

  "Multilingual support (Portuguese and English):": "Suporte multilingue (Português e Inglês):",
  "The platform offers support for multiple languages, including Portuguese and English.": "A plataforma oferece suporte para vários idiomas, incluindo Português e Inglês.",
  "Main Features": "Funcionalidades Principais",
  "Functionalities for Authenticated Users": "Funcionalidades para Utilizadores Autenticados",
  "Bidding Functionalities": "Funcionalidades de Licitação",
  "Other Features": "Outras Funcionalidades",
  "General Functionalities": "Funcionalidades Gerais",
  "Exact Match": "Pesquisa Exata",
  "Welcome to BidZenith": "Bem-vindo à BidZenith",
  "Manage Users": "Gerir Usuários",
  "Help": "Ajuda",
"Here you can find the main features of our platform.": "Aqui pode encontrar as principais funcionalidades da nossa plataforma.",
"Active Auctions Help": "Ajuda de Leilões Ativos",
"Features Help": "Ajuda de Funcionalidades",
"View all active auctions here.": "Veja todos os leilões ativos aqui.",
"View all active auctions here. Just click and participate in an auction.": "Veja todos os leilões ativos aqui. Basta clicar e participar de um leilão.",
"Testimonials Help": "Ajuda de Depoimentos",
"Read testimonials from our satisfied users.": "Leia depoimentos de nossos utilizadores satisfeitos.",
"Welcome to BidZenith": "Bem-vindo à BidZenith",
"Discover the Most Sought-After Auctions": "Descubra os Leilões Mais Procurados",
"Join exclusive auctions with an interactive and secure experience.": "Participe em leilões exclusivos com uma experiência interativa e segura.",
"Explore Auctions": "Explorar Leilões",
"Manage Users": "Gerir Utilizadores",
"Experience the Future of Online Auctions": "Experimente o Futuro dos Leilões Online",
"Real-Time Bidding": "Licitação em Tempo Real",
"Engage in auctions with live updates and real-time bidding capabilities.": "Participe em leilões com atualizações ao vivo e capacidades de licitação em tempo real.",
"Exclusive Items": "Itens Exclusivos",
"Access a curated selection of rare and exclusive items.": "Aceda a uma seleção exclusiva de itens raros e únicos.",
"Mobile Friendly": "Compatível com Dispositivos Móveis",
"Enjoy a seamless experience across all your devices.": "Desfrute de uma experiência perfeita em todos os seus dispositivos.",
"No active auctions at the moment.": "Sem leilões ativos no momento.",
"Upcoming Auctions": "Leilões Futuros",
"No upcoming auctions.": "Sem leilões futuros.",
"What Our Users Say": "O Que Os Nossos Utilizadores Dizem",
 "Username": "Nome de Usuário",
 "Upload Profile Picture:": "Upload de Foto de Perfil",
 "Save Changes": "Salvar",
 "Username:": "Nome de Usuário:",
 "Create Auction": "Criar Leilão",
    "Title": "Título",
    "Enter auction title": "Insira o título do leilão",
    "Category": "Categoria",
    "Select a category": "Selecione uma categoria",
    "Starting Price": "Preço Inicial",
    "Enter starting price": "Insira o preço inicial",
    "Reserve Price": "Preço de Reserva",
    "Enter reserve price": "Insira o preço de reserva",
    "Minimum Bid Increment": "Incremento Mínimo do Lance",
    "Enter minimum bid increment": "Insira o incremento mínimo do lance",
    "Starting Date": "Data de Início",
    "Select starting date and time": "Selecione a data e hora de início",
    "Ending Date": "Data de Término",
    "Select ending date and time": "Selecione a data e hora de término",
    "Location": "Localização",
    "Enter location": "Insira a localização",
    "Description": "Descrição",
    "Enter auction description": "Insira a descrição do leilão",
    "Status": "Estado",
    "Active": "Ativo",
    "Closed": "Encerrado",
    "Explore Auctions": "Explorar Leilões",
    "Minimum Price:": "Preço Mínimo:",
    "Maximum Price:": "Preço Máximo:",
    "Enter minimum price": "Insira o preço mínimo",
    "Enter maximum price": "Insira o preço máximo",
    "Status:": "Estado:",
    "Sort By:": "Ordenar por:",
    "All": "Todos",
    "Active": "Ativo",
    "Upcoming": "Em breve",
    "Completed": "Concluído",
    "None": "Nenhum",
    "Recent": "Recente",
    "Price: Low to High": "Preço: Baixo para Alto",
    "Price: High to Low": "Preço: Alto para Baixo",
    "Apply Filters": "Aplicar Filtros",
    "Current Bid": "Lance Atual",
    "Seller:": "Vendedor:",
    "View Auction": "Ver Leilão",
    "Follow Auction": "Seguir Leilão",
    "No auctions found for the applied filters.": "Nenhum leilão encontrado para os filtros aplicados.",
    "Search Results for": "Resultados da pesquisa por",
    "No auctions found.": "Nenhum leilão encontrado.",
    "Category": "Categoria",
    "Profile Information": "Informações do Perfil",
    "Update your account's profile information and email address.": "Atualize as informações do perfil e o endereço de e-mail da sua conta.",
    "Username": "Nome de Usuário",
    "Enter your username": "Digite o seu nome de usuário",
    "Email": "E-mail",
    "Enter your email address": "Digite o seu endereço de e-mail",
    "Full Name": "Nome Completo",
    "Enter your full name": "Digite o seu nome completo",
    "NIF": "NIF",
    "Enter your NIF": "Digite o seu NIF",
    "Save": "Guardar",
    "Saved.": "Guardado.",
    "Login": "Entrar",
    "Email Address": "Endereço de E-mail",
    "Password": "Senha",
    "Forgot Your Password?": "Esqueceu-se da sua senha?",
    "Register": "Registrar",
    "Confirm Password": "Confirmar Senha",
    "Reset Password": "Redefinir Senha",
    "Send Password Reset Link": "Enviar Link de Redefinição de Senha",
    "Reset Your Password": "Redefina Sua Senha",
    "New Password": "Nova Senha",
    "Enter your password": "Digite a sua senha",
    "Enter your new password": "Digite a sua nova senha",
    "Enter your password again": "Digite a sua senha novamente",
    "Confirm your password": "Confirme a sua senha",
    "Confirm your new password": "Confirme a sua nova senha",
    "Profile updated successfully.": "Perfil atualizado com sucesso.",
    "Upload Profile Picture:": "Carregar Foto de Perfil:",
    "Upload": "Carregar",
    "Edit Profile": "Editar Perfil",
    "Tax ID": "NIF",
    "Enter your tax ID": "Digite seu NIF",
  "Follow Auction": "Seguir leilão",
  "Unfollow Auction": "Deixar de seguir leilão",
  "View Followed Auctions" : "Ver leilões seguidos",

  "All Categories": "Todas as Categorias",
  "categories": {
        "Electronics": "Eletrónicos",
        "Art": "Arte",
        "Fashion": "Moda",
        "Home & Garden": "Casa & Jardim",
        "Vehicles": "Veículos",
        "Mobile Phones": "Telemóveis",
        "Laptops": "Portáteis",
        "Paintings": "Pinturas",
        "Sculptures": "Esculturas",
        "Men s Clothing": "Roupas Masculinas",
        "Women s Clothing": "Roupas Femininas",
        "Furniture": "Mobiliário",
        "Kitchen Appliances": "Eletrodomésticos de Cozinha",
        "Cars": "Carros",
        "Motorcycles": "Motas"
    },
    "Add Credits": "Adicionar Créditos",
    "Amount to Add": "Montante a Adicionar",
    "Credits: ": "Créditos: ",
    "Pay": "Pagar",
    "City, Country": "Cidade, País",
    "Write a brief description": "Escreva uma pequena descrição",
    "Followed Auctions": "Leilões Seguidos",
    "You are not following any auctions.": "Não está a seguir nenhum leilão.",
    "No bids have been placed on this auction yet.": "Nenhum lance foi colocado neste leilão ainda.",
    "Sold": "Vendido",
    "Unsold": "Não Vendido",
    "Error deleting user: ": "Erro ao apagar user",
    "User is already blocked": "User já se encontra bloqueado",
    "Not possible to block an admin": "Não é possível bloquear um admin",
    "User successfully blocked": "User bloqueado com sucesso",
    "Error deleting user": "Erro ao apagar user",
    "Your auction :title was canceled by an admin. Reason: :reason": "O seu leilão :title foi cancelado por um administrador. Motivo: :reason",
    "Your auction :title was suspended by an admin. Reason: :reason": "O seu leilão :title foi suspenso por um administrador. Motivo: :reason",
    "Your auction :title was reactivated by an admin.": "O seu leilão :title foi reativado por um administrador.",
    "Create new User": "Criar novo Utilizador",
    "Is Admin?": "É administrador?",
    "Save User": "Salvar user",
    "Edit User": "Editar User",
    "Full name:": "Nome Completo:",
    "Users List": "Lista de Users",
    "Search User...": "Pesquisar User",
    "Create User": "Criar User",
    "Name": "Nome",
    "Actions": "Ações",
    "Edit": "Editar",
    "Delete": "Remover",
    "Unblock": "Desbloquear",
    "Block": "Bloquear",
    "Suspend Auction": "Suspender leilão",
    "Reactivate Auction": "Reativar leilão",
    "Contact Seller": "Falar com Vendedor",
    "Suspend Auction": "Suspender leilão",
    "Confirm suspension": "Confirmar suspensão",
    "Reason for Suspension": "Razão para Suspensão",
    "Cancel My Auction": "Cancelar meu Leilão"

}
